OpenAtomFoundation/TobudOS/platform/vendor_bsp/nxp/CH-K-Lib/startup/DeviceSupport/IAR-ARM/startup_MK20D7.s
        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
        B .

        PUBWEAK SVC_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
        B .

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
        B .

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
        B .

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
        B .

                  DMA0_IRQHandler     
                  DMA1_IRQHandler     
                  DMA2_IRQHandler     
                  DMA3_IRQHandler     
                  DMA4_IRQHandler     
                  DMA5_IRQHandler     
                  DMA6_IRQHandler     
                  DMA7_IRQHandler     
                  DMA8_IRQHandler     
                  DMA9_IRQHandler     
                  DMA10_IRQHandler     
                  DMA11_IRQHandler     
                  DMA12_IRQHandler     
                  DMA13_IRQHandler     
                  DMA14_IRQHandler     
                  DMA15_IRQHandler     
               DMA_Error_IRQHandler
               MCM_IRQHandler
               FTFL_IRQHandler
               Read_Collision_IRQHandler
               LVD_LVW_IRQHandler
               LLW_IRQHandler
               Watchdog_IRQHandler
               Reserved39_IRQHandler
               I2C0_IRQHandler
               I2C1_IRQHandler
               SPI0_IRQHandler
               SPI1_IRQHandler
               Reserved44_IRQHandler
               CAN0_ORed_Message_buffer_IRQHandler
               CAN0_Bus_Off_IRQHandler
               CAN0_Error_IRQHandler
               CAN0_Tx_Warning_IRQHandler
               CAN0_Rx_Warning_IRQHandler
               CAN0_Wake_Up_IRQHandler
               I2S0_Tx_IRQHandler
               I2S0_Rx_IRQHandler
               Reserved53_IRQHandler
               Reserved54_IRQHandler
               Reserved55_IRQHandler
               Reserved56_IRQHandler
               Reserved57_IRQHandler
               Reserved58_IRQHandler
               Reserved59_IRQHandler
               UART0_LON_IRQHandler
               UART0_RX_TX_IRQHandler
               UART0_ERR_IRQHandler
               UART1_RX_TX_IRQHandler
               UART1_ERR_IRQHandler
               UART2_RX_TX_IRQHandler
               UART2_ERR_IRQHandler
               UART3_RX_TX_IRQHandler
               UART3_ERR_IRQHandler
               UART4_RX_TX_IRQHandler
               UART4_ERR_IRQHandler
               Reserved71_IRQHandler
               Reserved72_IRQHandler
               ADC0_IRQHandler
               ADC1_IRQHandler
               CMP0_IRQHandler
               CMP1_IRQHandler
               CMP2_IRQHandler
               FTM0_IRQHandler
               FTM1_IRQHandler
               FTM2_IRQHandler
               CMT_IRQHandler
               RTC_IRQHandler
               RTC_Seconds_IRQHandler
               PIT0_IRQHandler
               PIT1_IRQHandler
               PIT2_IRQHandler
               PIT3_IRQHandler
               PDB0_IRQHandler
               USB0_IRQHandler
               USBDCD_IRQHandler
               Reserved91_IRQHandler
               Reserved92_IRQHandler
               Reserved93_IRQHandler
               Reserved94_IRQHandler
               Reserved95_IRQHandler
               Reserved96_IRQHandler
               DAC0_IRQHandler
               Reserved98_IRQHandler
               TSI0_IRQHandler
               MCG_IRQHandler
               LPTimer_IRQHandler
               Reserved102_IRQHandler
               PORTA_IRQHandler
               PORTB_IRQHandler
               PORTC_IRQHandler
               PORTD_IRQHandler
               PORTE_IRQHandler
               Reserved108_IRQHandler
               Reserved109_IRQHandler
               SWI_IRQHandler
               DefaultISR                 
        SECTION .text:CODE:REORDER:NOROOT(1)
DMA0_IRQHandler
DMA1_IRQHandler
DMA2_IRQHandler
DMA3_IRQHandler
DMA4_IRQHandler
DMA5_IRQHandler
DMA6_IRQHandler
DMA7_IRQHandler
DMA8_IRQHandler
DMA9_IRQHandler
DMA10_IRQHandler
DMA11_IRQHandler
DMA12_IRQHandler
DMA13_IRQHandler
DMA14_IRQHandler
DMA15_IRQHandler
DMA_Error_IRQHandler
MCM_IRQHandler
FTFL_IRQHandler
Read_Collision_IRQHandler
LVD_LVW_IRQHandler
LLW_IRQHandler
Watchdog_IRQHandler
Reserved39_IRQHandler
I2C0_IRQHandler
I2C1_IRQHandler
SPI0_IRQHandler
SPI1_IRQHandler
Reserved44_IRQHandler
CAN0_ORed_Message_buffer_IRQHandler
CAN0_Bus_Off_IRQHandler
CAN0_Error_IRQHandler
CAN0_Tx_Warning_IRQHandler
CAN0_Rx_Warning_IRQHandler
CAN0_Wake_Up_IRQHandler
I2S0_Tx_IRQHandler
I2S0_Rx_IRQHandler
Reserved53_IRQHandler
Reserved54_IRQHandler
Reserved55_IRQHandler
Reserved56_IRQHandler
Reserved57_IRQHandler
Reserved58_IRQHandler
Reserved59_IRQHandler
UART0_LON_IRQHandler
UART0_RX_TX_IRQHandler
UART0_ERR_IRQHandler
UART1_RX_TX_IRQHandler
UART1_ERR_IRQHandler
UART2_RX_TX_IRQHandler
UART2_ERR_IRQHandler
UART3_RX_TX_IRQHandler
UART3_ERR_IRQHandler
UART4_RX_TX_IRQHandler
UART4_ERR_IRQHandler
Reserved71_IRQHandler
Reserved72_IRQHandler
ADC0_IRQHandler
ADC1_IRQHandler
CMP0_IRQHandler
CMP1_IRQHandler
CMP2_IRQHandler
FTM0_IRQHandler
FTM1_IRQHandler
FTM2_IRQHandler
CMT_IRQHandler
RTC_IRQHandler
RTC_Seconds_IRQHandler
PIT0_IRQHandler
PIT1_IRQHandler
PIT2_IRQHandler
PIT3_IRQHandler
PDB0_IRQHandler
USB0_IRQHandler
USBDCD_IRQHandler
Reserved91_IRQHandler
Reserved92_IRQHandler
Reserved93_IRQHandler
Reserved94_IRQHandler
Reserved95_IRQHandler
Reserved96_IRQHandler
DAC0_IRQHandler
Reserved98_IRQHandler
TSI0_IRQHandler
MCG_IRQHandler
LPTimer_IRQHandler
Reserved102_IRQHandler
PORTA_IRQHandler
PORTB_IRQHandler
PORTC_IRQHandler
PORTD_IRQHandler
PORTE_IRQHandler
Reserved108_IRQHandler
Reserved109_IRQHandler
SWI_IRQHandler
DefaultISR
        B DefaultISR

        END
